---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType.GradientColor
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType
source: html/5f1e5c03-407b-53fc-8902-1228734907ff.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType.GradientColor

Intermediate and min/max color settings are used to interpolate color for values between adjacent entries.